#include <iostream>
using namespace std;
int main() {
	int a;
	//If1.ƒано целое число.≈сли оно €вл€етс€ положительным, то прибавить к
		//нему 1; в противном случае не измен€ть его.¬ывести полученное число

	//int a;
   // cin >> a;
	//if (a > 0); {
	//a++;

	//cout << a;
//}

	//If2.ƒано целое число.≈сли оно €вл€етс€ положительным, то прибавить к
		//нему 1; в противном случае вычесть из него 2. ¬ывести полученное число.
	//int a;
   // cin >> a;
	//if (a > 0); {
	//a++;
   //else {
   //a -= 2;
  //}
//cout << a << endl;
//}
	//If3.ƒано целое число.≈сли оно €вл€етс€ положительным, то прибавить к
		//нему 1; если отрицательным, то вычесть из него 2; если нулевым, то
		//заменить его на 10. ¬ывести полученное число.
	//int a;
	//cin >> a;
	//if (a > 0) {
		//a++;
	//else if (a < 0) {
		//a -= 2;
//}
	//else if (a == 0) {
		//a = 10;
	//}
	//cout << a << endl;
	//}

	//If7.ƒаны два числа.¬ывести пор€дковый номер меньшего из них.
	int a, b;
	cin >> a >> b;
	if (a > b) {


	}

	else if (a - b) {
	

	}











}